Revit 2024 API
DividedSurface.Host Property
The element whose surface has been divided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Element Host { get; }
Visual Basic
Public ReadOnly Property Host As Element
	Get
Visual C++
public:
property Element^ Host {
	Element^ get ();
}
See Also
DividedSurface Class
Autodesk.Revit.DB Namespace